src/Documents/РасходнаяНакладнаяЗадача_3/РасходнаяНакладнаяЗадача_3.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладнаяЗадача_3</name>
  <registerRecords>AccumulationRegister.ОстаткиТовараЗадача_3</registerRecords>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура_Задача_3</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.СкладЗадача_3</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ОстаткиТовараЗадача_3/ОстаткиТовараЗадача_3.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТовараЗадача_3</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура_Задача_3</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.СкладЗадача_3</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/РасходнаяНакладнаяЗадача_3/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	
	МенеджерВТ = Новый МенеджерВременныхТаблиц;

	// регистр ОстаткиТовараЗадача_3
	Движения.ОстаткиТовараЗадача_3.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ОстаткиТовараЗадача_3.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = ТекСтрокаТовары.Склад;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяЗадача_3Товары.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяЗадача_3Товары.Количество КАК Количество,
	|	РасходнаяНакладнаяЗадача_3Товары.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.РасходнаяНакладнаяЗадача_3.Товары КАК РасходнаяНакладнаяЗадача_3Товары
	|ГДЕ
	|	РасходнаяНакладнаяЗадача_3Товары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Выполнить();
	
	Запрос2 = Новый Запрос;
	Запрос2.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	ВТ_Товары.Номенклатура КАК Номенклатура,
	|	ВТ_Товары.Склад КАК Склад,
	|	ЕСТЬNULL(ОстаткиТовараЗадача_3Остатки.КоличествоОстаток, 0) - ВТ_Товары.Количество КАК ОстатокПослеРасхода
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовараЗадача_3.Остатки КАК ОстаткиТовараЗадача_3Остатки
	|		ПО ВТ_Товары.Номенклатура = ОстаткиТовараЗадача_3Остатки.Номенклатура
	|		И ВТ_Товары.Склад = ОстаткиТовараЗадача_3Остатки.Склад";
	
	Выборка = Запрос2.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если  Выборка.ОстатокПослеРасхода < 0 Тогда
			Сообщить("Номенклатура " + Выборка.Номенклатура + " не хватает на складе " + Выборка.Склад + " на " + (-Выборка.ОстатокПослеРасхода) + " шт.");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
